{
  "home.title": "Construyendo el futuro de la colaboración de talento",
  "hero.title": "Construye el futuro del trabajo. Juntos.",
  "hero.subtitle": "The Full-Stack Team es una plataforma open source para conectar profesionales, equipos y empresas con contratos inteligentes, IA y colaboración transparente.",
  "hero.cta.explore": "Explora la plataforma",
  "hero.cta.star": "⭐ Dale una estrella en GitHub",
  "nav.features": "Características",
  "nav.developers": "Desarrolladores",
  "nav.professionals": "Profesionales",
  "nav.companies": "Empresas",
  "nav.blog": "Blog",
  "nav.star": "Dale una estrella a TFST",
  "footer.rights": "Todos los derechos reservados.",
  "footer.poweredBy": "Impulsado por nuestros",
  "footer.contributors": "colaboradores",
  "footer.community": "Comunidad",
  "footer.docs": "Documentación técnica",
  "footer.contribute": "Contribuir",
  "footer.privacy": "Privacidad",
  "footer.terms": "Términos",
  "footer.imprint": "Aviso legal",
  "footer.ctaText": "Ayúdanos a construir el futuro del talento descentralizado.",
  "footer.ctaButton": "Únete a TFST",
  "privacy.title": "Política de Privacidad",
  "privacy.meta": "Conoce cómo TFST maneja los datos y la privacidad.",
  "privacy.intro": "TFST (The Full Stack Team) es actualmente un proyecto de código abierto desarrollado por voluntarios en su tiempo libre. Nuestro objetivo es construir una plataforma sólida de gestión de talento, pero el software se encuentra en fase pre-lanzamiento (alfa).",
  "privacy.scopeTitle": "Ámbito de esta política",
  "privacy.scope": "Esta política de privacidad se aplica únicamente a los sitios web y servicios mantenidos directamente por el proyecto TFST. En este momento, TFST no recopila, procesa ni almacena datos personales de los usuarios, salvo que se indique explícitamente.",
  "privacy.dataTitle": "Recogida y uso de datos",
  "privacy.data": "TFST no rastrea a los usuarios, no utiliza cookies ni recopila información personal por defecto. Si en el futuro alguna funcionalidad requiere datos, se documentará y será siempre opcional.",
  "privacy.responsibilityTitle": "Exención de responsabilidad",
  "privacy.responsibility": "Este software se proporciona 'tal cual', sin ninguna garantía. Los mantenedores y colaboradores no son responsables de problemas, pérdidas de datos o daños derivados del uso de TFST mientras permanezca en fase experimental o de prueba.",
  "privacy.contactTitle": "Contacto",
  "privacy.contact": "Si tienes preguntas, escríbenos a juan@jgcarmona.com o contribuye directamente en GitHub: https://github.com/jgccon/tfst",

"terms.title": "Términos y Condiciones",
  "terms.intro": "Al acceder y utilizar este sitio web, aceptas quedar sujeto a estos términos y condiciones. Si no estás de acuerdo con alguna parte de estos términos, por favor abstente de utilizar el sitio.",
  "terms.useTitle": "Licencia de Uso",
  "terms.use": "Se concede permiso para ver y utilizar los materiales de este sitio web únicamente con fines personales y no comerciales. No se permite modificar, redistribuir ni utilizar ninguna parte del sitio con fines comerciales sin consentimiento previo por escrito.",
  "terms.disclaimerTitle": "Descargo de Responsabilidad",
  "terms.disclaimer": "Este sitio web se proporciona 'tal cual'. No ofrecemos garantías, expresas o implícitas, y rechazamos cualquier otra garantía, incluyendo, sin limitación, garantías implícitas de comerciabilidad o adecuación para un propósito particular. No garantizamos que el sitio esté libre de errores, sea seguro o esté disponible de forma continua.",
  "terms.limitationsTitle": "Limitaciones",
  "terms.limitations": "En ningún caso el titular o los colaboradores serán responsables de ningún daño (incluyendo, sin limitación, pérdida de datos, lucro cesante o interrupción del servicio) que surja del uso o la imposibilidad de uso de este sitio web, incluso si se ha notificado previamente la posibilidad de tales daños.",
  "terms.modificationsTitle": "Modificaciones",
  "terms.modifications": "Nos reservamos el derecho de modificar estos términos de uso en cualquier momento y sin previo aviso. Al utilizar este sitio web, aceptas quedar sujeto a la versión vigente de los Términos y Condiciones.",
  "terms.contactTitle": "Contacto",
  "terms.contact": "Si tienes preguntas sobre estos términos, puedes escribirnos a juan@jgcarmona.com.",

  "imprint.title": "Aviso Legal (Impressum)",
  "imprint.intro": "Este sitio web es mantenido como un proyecto personal por el titular que figura a continuación. No está destinado al uso comercial y puede contener funcionalidades experimentales o incompletas.",
  "imprint.ownerTitle": "Titular",
  "imprint.owner": "Juan G Carmona",
  "imprint.addressTitle": "Dirección",
  "imprint.address": "Madrid, España",
  "imprint.contactTitle": "Contacto",
  "imprint.contact": "Correo electrónico: juan@jgcarmona.com",
  "imprint.disclaimerTitle": "Descargo de Responsabilidad",
  "imprint.disclaimer": "La información contenida en este sitio web se proporciona únicamente con fines informativos generales. No se asume responsabilidad por la integridad, exactitud o disponibilidad de la información. Este proyecto se encuentra en fase experimental (pre-producción) y no se ofrecen garantías sobre su rendimiento o seguridad de datos."
}
